workstation/openfoam-master-tutorials/tutorials/combustion/reactingFoam/RAS/membrane/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    membrane
    {
        type        faceZone;
        zoneName    membrane;

        patches
        {
            master
            {
                name            membranePipe;
                type            wall;
            }
            slave
            {
                name            membraneSleeve;
                type            wall;
            }
        }
    }
}


// ************************************************************************* //
